test/tests/multiapps/warm_plate_simple/buoyantCavity/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    back
    {
        type            calculated;
        value           uniform 100000;
    }
    bottom
    {
        type            calculated;
        value           uniform 100000;
    }
    left
    {
        type            calculated;
        value           uniform 100000;
    }
    front
    {
        type            calculated;
        value           uniform 100000;
    }
    right
    {
        type            calculated;
        value           uniform 100000;
    }
    top
    {
        type            calculated;
        value           uniform 100000;
    }
}


// ************************************************************************* //
