test/tests/multiapps/warm_plate_simple/buoyantCavity/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.000375;

boundaryField
{
    back
    {
        type            kqRWallFunction;
        value           uniform 0.000375;
    }
    bottom
    {
        type            kqRWallFunction;
        value           uniform 0.000375;
    }
    left
    {
        type            kqRWallFunction;
        value           uniform 0.000375;
    }
    front
    {
        type            kqRWallFunction;
        value           uniform 0.000375;
    }
    right
    {
        type            kqRWallFunction;
        value           uniform 0.000375;
    }
    top
    {
        type            kqRWallFunction;
        value           uniform 0.000375;
    }
}


// ************************************************************************* //
