test/tests/multiapps/warm_plate_simple/buoyantCavity/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0.12;

boundaryField
{
    back
    {
        beta1           0.075;
        blended         0;
        type            omegaWallFunction;
        value           uniform 0.12;
    }
    bottom
    {
        beta1           0.075;
        blended         0;
        type            omegaWallFunction;
        value           uniform 0.12;
    }
    left
    {
        beta1           0.075;
        blended         0;
        type            omegaWallFunction;
        value           uniform 0.12;
    }
    front
    {
        beta1           0.075;
        blended         0;
        type            omegaWallFunction;
        value           uniform 0.12;
    }
    right
    {
        beta1           0.075;
        blended         0;
        type            omegaWallFunction;
        value           uniform 0.12;
    }
    top
    {
        beta1           0.075;
        blended         0;
        type            omegaWallFunction;
        value           uniform 0.12;
    }
}


// ************************************************************************* //
